# Homebrew Bundle - Automated package installation

# Core development tools
brew "gcc"                        # GNU compiler collection (commands: gcc, g++)
brew "git"                        # Version control system (command: git)
brew "gh"                         # GitHub CLI (command: gh)
brew "yadm"                       # Yet Another Dotfiles Manager (command: yadm)

# Shell and terminal enhancements
brew "zsh"                        # Z Shell - powerful interactive shell (command: zsh)
brew "zsh-completions"            # Additional completions for zsh (auto-loaded by zsh)
brew "zsh-autosuggestions"        # Fish-like autosuggestions for zsh (loaded in .zshrc)
brew "zsh-syntax-highlighting"    # Syntax highlighting for zsh (loaded in .zshrc)
brew "starship"                   # Cross-shell prompt (run: starship init)
brew "fzf"                        # Fuzzy finder for command-line (file searching)
brew "thefuck"                    # Command correction tool (run: thefuck COMMAND)
brew "direnv"                     # Environment switcher (enable with: direnv allow)
# brew "atuin"                    # Replaced by mcfly for shell history
brew "mcfly"                      # Smart shell history search with context awareness
brew "zoxide"                     # Smarter cd command (use: z directory)

# Modern CLI replacements
brew "bat"                        # Cat clone with syntax highlighting (command: bat)
brew "eza"                        # Modern replacement for ls (commands: eza, aliased to ls)
brew "fd"                         # Simple, fast alternative to find (command: fd)
brew "ripgrep"                    # Fast grep alternative (command: rg)
brew "difftastic"                 # Structural diff tool that understands syntax (command: difft)

# Terminal UI tools
brew "lazygit"                    # Terminal UI for git commands (run: lazygit)
brew "lazydocker"                 # Terminal UI for docker management (run: lazydocker)
brew "btop"                       # Resource monitor with visuals (command: btop)
brew "neovim"                     # Hyperextensible Vim-based text editor (command: nvim)

# Data processing tools
brew "jq"                         # Command-line JSON processor (command: jq)
brew "httpie"                     # User-friendly HTTP client (command: http)

# Development environment managers
brew "fnm"                        # Fast Node.js version manager (commands: fnm use, fnm install)
brew "pyenv"                      # Python version manager (commands: pyenv install, pyenv global)

# Utilities
brew "just"                       # Modern command runner (command: just)
brew "xclip"                      # X11 clipboard tool (commands: xclip, xclip -o)
